10/data/attachments/8dc95a079843927c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:username>
            <nif:friendToBeAdded>Tina_kitchen_Friend_62349_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>